app/controllers/answers_controller.rb

INSERT INTO "answers" ("content", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Seems to be"], ["user_id", 1], ["question_id", 1], ["created_at", "2017-07-21 18:02:27.352820"], ["updated_at", "2017-07-21 18:02:27.352820"]]
---
  def create
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save