app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "answer_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["answer_id", 1], ["content", "OHh Yaa"], ["created_at", "2017-07-21 18:02:39.466148"], ["updated_at", "2017-07-21 18:02:39.466148"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save