app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Is this Working Like Expected?\r\n"], ["user_id", 1], ["created_at", "2017-07-21 18:02:20.351377"], ["updated_at", "2017-07-21 18:02:20.351377"]]
---
  def create
    @question = Question.new(question_params)
     @question.user_id=current_user.id


    respond_to do |format|
      if @question.save